# Terraform environment test
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_api_management.admin_test_apim will be created
  + resource "azurerm_api_management" "admin_test_apim" {
      + client_certificate_enabled    = false
      + developer_portal_url          = (known after apply)
      + gateway_disabled              = false
      + gateway_regional_url          = (known after apply)
      + gateway_url                   = (known after apply)
      + id                            = (known after apply)
      + location                      = "norwayeast"
      + management_api_url            = (known after apply)
      + name                          = "altinn-apim-test-apim"
      + notification_sender_email     = (known after apply)
      + portal_url                    = (known after apply)
      + private_ip_addresses          = (known after apply)
      + public_ip_addresses           = (known after apply)
      + public_network_access_enabled = true
      + publisher_email               = "test-team-platform@ai-dev.no"
      + publisher_name                = "Team-Platform"
      + resource_group_name           = "altinn-apim-test-rg"
      + scm_url                       = (known after apply)
      + sku_name                      = "Developer_1"
      + virtual_network_type          = "None"

      + delegation (known after apply)

      + hostname_configuration (known after apply)

      + protocols (known after apply)

      + security (known after apply)

      + sign_in (known after apply)

      + sign_up (known after apply)

      + tenant_access (known after apply)
    }

  # azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "norwayeast"
      + name     = "altinn-apim-test-rg"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @tjololo |
| Action | `pull_request` |
| Working Directory | `./infrastructure/adminservices-test/altinn-apim-test-rg` |
| State File | `github.com/altinn/altinn-platform/environments/test/altinn-apim-test-rg.tfstate` |
| Plan File | `github.com_altinn_altinn-platform_environments_test_altinn-apim-test-rg.tfstate.tfplan`